Repository: mozilla-l10n/mt-training-data
Catalog: tt/tt_pontoon.tmx
Source language: en_us
Languages: tt

source: Please change your password
tt: Зинһар, серсүзегезне үзгәртегез

source: Please enable cookies and local storage in your browser to access Firefox Accounts. Doing so will enable functionality such as remembering you between sessions.
tt: Firefox Хисапларына ирешү өчен, зинһар гизгечегездә кукиларны һәм җирле саклагычны рөхсәт итегез. Моның нәтиҗәсендә утырышлар арасында Сезне истә тоту кебек мөмкинлекләр ачылачак.

source: Please enter verification code
tt: Зинһар, раслау кодын кертегез

source: Please select one
tt: Зинһар берне сайлагыз

source: Please Select One
tt: Зинһар берне сайлагыз

source: Please try again later
tt: Зинһар соңрак тырышып карагыз

source: Please try again later.
tt: Зинһар соңрак тырышып карагыз.

source: Preferences
tt: Көйләүләр

source: Primary account email required for reset
tt: Алыштыру өчен хисапның төп эл. почта адресы кирәк

source: Primary account email required for sign-in
tt: Керү өчен хисапның төп эл. почта адресы кирәк

source: Primary email
tt: Төп эл. почта

source: Primary email already confirmed
tt: Беренчел эл. почта адресы расланды инде

source: Primary email set to %(email)s
tt: Беренчел эл. почта адресы итеп %(email)s билгеләнде

source: Primary email updated
tt: Төп эл. почта адресы яңартылды

source: Primary email verified
tt: Төп эл. почта адресы расланды

source: Primary email verified successfully
tt: Беренчел электрон почта уңышлы расланды

source: Print
tt: Бастыру

source: Print button image
tt: Бастыру төмәсе сурәте

source: Printed
tt: Бастырылды

source: Privacy notice:
tt: Хоусыйлык аңлатмасы:

source: Privacy Notice
tt: Хоусыйлык Аңлатмасы

source: Problem loading customer
tt: Кулланучыны йөкләгәндә хата китте

source: Problem loading plans
tt: Планнарны йөкләгәндә хата китте

source: Problem loading profile
tt: Профильне йөкләгәндә хата китте

source: Proceed
tt: Дәвам итү

source: { -product-firefox-account } menu
tt: { -product-firefox-account } меню

source: Profile picture
tt: Профиль рәсеме

source: Ready
tt: Әзер

source: Ready, set, sync
tt: Стартка, әзер бул, синхронла

source: Receive new link
tt: Яңа сылтама алу

source: Recent Activity
tt: Соңгы гамәлләр

source: Recovery code
tt: Коткару коды

source: Recovery code consumed
tt: Коткару коды кулланылды

source: Recovery code not found
tt: Тергезү коды табылмады

source: Recovery code required
tt: Коткару коды кирәк

source: Recovery Codes
tt: Коткару кодлары

source: Recovery code used
tt: Коткару коды кулланылды

source: Recovery key
tt: Коткару ачкычы

source: Recovery key created.
tt: Коткару ачкычы ясалды.

source: Recovery key not found
tt: Тергезү ачкычы табылмады

source: Recovery key required
tt: Коткару ачкычы кирәк

source: Re-enter new password
tt: Яңа серсүзне кабатлагыз

source: Re-enter password
tt: Паролны янәдән кертегез

source: Refresh email
tt: Эл. почтаны яңарту

source: Refresh two-step authentication
tt: Ике адымлы аутентификацияне яңарту

source: %(region)s, %(country)s (estimated)
tt: %(region)s, %(country)s (чама белән)

source: Remember password? Sign in
tt: Паролыгыз исегездәме? Керегез

source: Remember password? Sign in.
tt: Паролыгыз исегездәме? Керегез.

source: Remove email
tt: Эл. почтаны бетерү

source: Remove photo
tt: Фотоны бетерү

source: Remove recovery key?
tt: Коткару ачкычы бетерелсенме?

source: Repeat password
tt: Паролны кабатлау

source: Report activity
tt: Активлыкны хәбәр итү

source: Report unauthorized sign-in?
tt: Авторизацияләнмәгән керү хакында хәбәр итәргәме?

source: Request body too large
tt: Сорау гәүдәсе артык зур

source: Request for permission
tt: Рөхсәт сорау

source: Reset account
tt: Хисапны ташлату

source: Reset email sent
tt: Парольне үзгәртү хаты җибәрелде

source: Reset password
tt: Паролны алыштыру

source: Reset password link damaged
tt: Паролны алыштыру сылтамасына зыян килгән

source: Reset password link expired
tt: Паролны алыштыру сылтамасының вакыты узган

source: Reset your Firefox Account password
tt: Firefox Хисабы паролын алыштыру

source: Reset your password
tt: Серсүзегезне алыштырыгыз

source: Resources failed to load
tt: Ресурсларны йөкләү хатасы

source: Retake photo
tt: Яңадан фотога төшерү

source: Rotate
tt: Борып кую

source: Save recovery codes
tt: Коткару кодларын саклау

source: Save recovery key
tt: Коткару ачкычын саклау

source: Save settings
tt: Көйләүләрне саклау

source: Saving…
tt: Саклау…

source: Scan authentication code
tt: Аутентификация кодын сканерлау

source: Scan to connect another device
tt: Башка җиһазны тоташтыру өчен сканерлау

source: Script error
tt: Скрипт хатасы

source: Secondary email
tt: Икенчел эл. почта адресы

source: Secondary email added
tt: Икенчел эл. почта өстәлде

source: Secondary email removed
tt: Икенчел электрон почта бетерелде

source: Secondary email verified
tt: Икенчел эл. почта адресы расланды

source: Secondary email verified successfully
tt: Икенчел электрон почта уңышлы расланды

source: Secondary Firefox Account email added
tt: Firefox Хисабына икенчел эл. почта өстәлде

source: Secondary Firefox Account email removed
tt: Икенчел Firefox Хисабы эл. почтасы бетерелде

source: Second, if Firefox stores passwords to websites, you should change those passwords as well. Attackers may have access to those passwords, so you should check those accounts for suspicious activity.
tt: Икенчедән, әгәр Firefox'та башка сайтларга керү серсүзләре сакланган булса, ул серсүзләрне дә үзгәртегез. Ул серсүзләр һөҗүмчеләр кулына эләккән булырга мөмкин, бу сәбәптән ул сайтлардагы хисап язмаларыгызда шикле хәрәкәтләр булмаганмы икәнен тикшерегез.

source: Security
tt: Хәвефсезлек

source: Security code
tt: Иминлек коды

source: Security codes from your authentication app will now be required at each sign-in.
tt: Алга таба һәр керүегездә аутентификация кулланмагыздан алынган хәвефсезлек кодлары кирәк булачак.

source: Security codes will no longer be required at each sign-in.
tt: Артык һәр керүдә хәвефсезлек кодлары таләп ителмәячәк.

source: Security Events
tt: Иминлеккә бәйле вакыйгалар

source: Send
tt: Җибәрү

source: Server busy, try again soon
tt: Сермер мәшгуль, бераздан янәдән тырышып карагыз

source: %(serviceName)s wants the following information from your account:
tt: %(serviceName)s хисабыгыздан түбәндәге мәгълүматны таләп итә:

source: Session expired. Sign in to continue.
tt: Сессиянең мөддәте бетте. Дәвам итү өчен керегез.

source: Set up next device
tt: Киләсе җиһазны көйләү

source: Show code
tt: Кодны күрсәтү

source: Show password
tt: Серсүзне күрсәтү

source: Sign in
tt: Керү

source: Sign-in already confirmed
tt: Керү расланды инде

source: Sign-in code for Firefox
tt: Firefox'ка керү коды

source: Sign-in confirmed
tt: Керү расланды

source: Sign in &rarr;
tt: Керү &rarr;

source: Sign in to continue
tt: Дәвам итү өчен керегез

source: Sign in to Firefox for Android to complete set-up
tt: Көйләүне тәмамлар өчен Android өчен Firefox'ка керегез

source: Sign in to Firefox for iOS to complete set-up
tt: Көйләүне тәмамлар өчен iOS өчен Firefox'ка керегез

source: Sign in to Firefox on another device to complete set-up
tt: Көйләүне тәмамлар өчен башка бер җиһаздан Firefox'ка керегез

source: Sign in to Sync
tt: Синхронлауга керү

source: Sign in to Sync:
tt: Синхронлауга керү:

source: Sign in to this Firefox to complete set-up
tt: Көйләүне тәмамлар өчен бу Firefox'ка керегез

source: Sign into your account
tt: Хисабыгызга керегез

source: Sign out
tt: Чыгу

source: Sign up for more
tt: Күбрәк белү өчен теркәлегез

source: Signup is coming soon to Firefox for iOS
tt: iOS өчен Firefox'та теркәлү мөмкинлеге тиздән пәйда булачак

source: SMS not sent, please try again
tt: SMS җибәрелмәде, зинһар янәдән тырышып карагыз

source: SMS sent
tt: SMS җибәрелде

source: Something went wrong. Please close this tab and try again.
tt: Нидер булды. Бу битне ябып, зинһар янәдән тырышып карагыз.

source: <span class="number">1</span>Open the camera app on your device
tt: <span class="number">1</span>Җиһазыгызда камера кушымтасын ачыгыз

source: <span class="number">3</span>Install Firefox and open it on your device
tt: <span class="number">3</span>Җиһазыгызга Firefox-ны урнаштырыгыз һәм аны ачыгыз

source: <span class="number">4</span>Sign into your account
tt: <span class="number">4</span>Хисабыгызга керегез

source: Start browsing
tt: Гизүне башлау

source: %(stateCode)s, %(country)s (estimated)
tt: %(stateCode)s, %(country)s (чама белән)

source: Step 1 of 2
tt: Адым 1/2

source: Step 1 of 2: Re-enter password
tt: Aдым 1/2: Серсүзне янәдән кертегез

source: Step 1 of 3
tt: Адым 1/3

source: Step 2 of 2
tt: Адым 2/2

source: Step 2 of 3
tt: Адым 2/3

source: Step 3 of 3
tt: Адым 3/3

source: Still adding devices?
tt: Әле дә җиһазлар өстисезме?

source: Still adding devices? Sign in to Firefox on another device to complete set-up
tt: Әле дә җиһазлар өстисезме? Көйләүне тәмамлар өчен башка бер җиһаздан Firefox-ка керегез

source: Submit new password
tt: Яңа паролны җибәрү

source: Subscribed successfully
tt: Абунәгә язылу уңышлы

source: Subscribe %(email)s
tt: %(email)s язылу

source: Subscription confirmation
tt: Язылуны раслау

source: Subscription has already been cancelled
tt: Язылу бетерелгән инде

source: Subscriptions
tt: Язылулар

source: Successfully connected
tt: Уңышлы тоташтырылды

source: Suspicious
tt: Шикле

source: Suspicious device disconnected
tt: Шикле җиһаз тоташкан

source: Sync another device
tt: Башка җиһазны синхронлау

source: Sync Firefox between devices
tt: Firefox-ны җиһазлар арасында синхронлау

source: Sync this device
tt: Бу җиһазны синхронлау

source: System unavailable, try again soon
tt: Система сүндерелгән, бераздан янәдән тырышып карагыз

source: Take photo
tt: Фотога төшерү

source: Terms of Service
tt: Куллану Шартлары

source: Thanks for choosing Firefox! You can install Firefox for mobile here: %(link)s
tt: Firefox'ны сайлавыгыз өчен рәхмәт! Мобиль җиһазлар өчен Firefox'ны монда таба аласыз: %(link)s

source: Thank you!
tt: Рәхмәт!

source: Thank you for your vigilance
tt: Игътибарлылыгыз өчен рәхмәт

source: That confirmation link was already used, and can only be used once.
tt: Бу раслау сылтамасы бер кулланылган булган инде, һәм башка кулланыла алмый.

source: The device is:
tt: Җиһаз:

source: The Firefox accounts team
tt: Firefox хисап язмалары такымы

source: The Firefox Accounts team
tt: Firefox Хисап язмалары такымы

source: The image dimensions must be at least 100x100px
tt: Рәсемнең үлчәмнәре кимендә 100x100 пиксель булырга тиеш

source: The link you clicked to reset your password is expired.
tt: Паролыгызны үзгәртү өчен Сез баскан сылтаманың мөддәте узган.

source: The link you clicked to verify your email is expired.
tt: Эл. почтагызны раслау өчен Сез чирткән сылтаманың мөддәте чыккан.

source: The link you clicked was missing characters, and may have been broken by your email client. Copy the address carefully, and try again.
tt: Сез баскан сылтамадан кайбер хәрефләр төшеп калган иде, һәм электрон почта программагыз бозган булуы мөмкин. Игътибар белән адресны копияләп, тагын бер кат тырышып карагыз.

source: The page you requested is not found. We've been notified and will fix any links that may be broken.
tt: Сез сораган бит табылмады. Без моның турында хәбәр алдык, һәм хаталы була алучы сылтамаларны төзәтәчәкбез.

source: The request was blocked for security reasons
tt: Сорау хәвефсезлек саклау максатыннан блокланды

source: This device is connected
tt: Бу җиһаз тоташкан

source: This endpoint is no longer supported
tt: Бу сорау адресы тотылмый инде

source: This Firefox is connected
tt: Бу Firefox тоташкан

source: This is an automated email.
tt: Бу автоматик бер электрон хат.

source: This is an automated email; if you did not authorize this action, then <a %(passwordChangeLinkAttributes)s>please change your password</a>.
tt: Бу автоматик бер электрон хат. Әгәр бу гамәлгә рөхсәт бирмәгән булсагыз, зинһар <a %(passwordChangeLinkAttributes)s>паролыгызны үзгәртегез</a>.

source: This is an automated email; if you did not authorize this action, then <a %(passwordChangeLinkAttributes)s>please change your password.</a>
tt: Бу автоматик бер электрон хат. Әгәр бу гамәлгә рөхсәт бирмәгән булсагыз, зинһар <a %(passwordChangeLinkAttributes)s>паролыгызны үзгәртегез</a>.

source: This is an automated email; if you did not authorize this action, then <a %(resetLinkAttributes)s>please reset your password</a>.
tt: Бу автоматик бер электрон хат. Әгәр бу гамәлгә рөхсәт бирмәгән булсагыз, зинһар <a %(resetLinkAttributes)s>паролыгызны үзгәртегез</a>.

source: This is an automated email; if you didn’t add a new device to your Firefox Account, you should change your password immediately at %(passwordChangeLink)s
tt: Бу автоматик бер электрон хат. Әгәр Firefox Хисабыгызга яңа җиһазны өстәмәгән булсагыз, хәзер үк %(passwordChangeLink)s битендә паролыгызны үзгәртегез

source: This is an automated email; if you didn’t change the password to your Firefox Account, you should reset it immediately at %(resetLink)s
tt: Бу автоматик бер электрон хат. Firefox Хисабыгызның паролын үзгәртмәгән булсагыз, %(resetLink)s адресында хәзер үк паролыгызны алыштырыгыз

source: This is an automated email; if you received it in error, no action is required.
tt: Бу автоматик электрон хат. Аның килүе бер хата аркасында булды дип уйласагыз, берни дә эшләргә кирәкми.

source: This is a required field
tt: Бу кыр мәҗбүри

source: This recovery key can no longer be used to recover your account.
tt: Бу коткару коды инде хисабыгызны торгызу өчен кулланыла алмас.

source: This verification code has expired
tt: Бу раслау кодының вакыты чыккан

source: To better protect your Firefox data, there is an authorization code waiting for you at %(email)s.
tt: Firefox бирелгәннәрәгезне яхшырак саклау өчен, %(email)s адресына бер раслау кодын җибәрдек.

source: To better protect your Firefox data, we've emailed a confirmation link to %(email)s
tt: Firefox бирелгәннәрен яхшырау саклау өчен, %(email)s адресына раслау сылтамасын җибәрдек

source: to continue to %(serviceName)s
tt: %(serviceName)s хезмәтенә күчү

source: To prevent further unauthorized access to your Firefox Account, we’ve reset your password and are notifying you as a precaution.
tt: Башкаларның Firefox хисап язмагызга рөхсәтсез ирешүенә юл бирмәү өчен, без серсүзегезне үзгәрттек һәм саклану чарасы буларак бу хат аша Сезгә шул хакта хәбәр итәбез.

source: TOTP token not found
tt: TOTP токен табылмады

source: %(translatedTimeAgo)s in %(translatedCountry)s
tt: %(translatedTimeAgo)s менә бу илдә: %(translatedCountry)s

source: %(translatedTimeAgo)s near %(translatedCity)s, %(translatedState)s, %(translatedCountry)s
tt: %(translatedTimeAgo)s %(translatedCity)s, %(translatedState)s, %(translatedCountry)s тирәсендә

source: Try again
tt: Янәдән тырышып карау

source: Two-step authentication
tt: Ике адымлы аутентификация

source: Two-step Authentication
tt: Ике адымлы аутентификация

source: Two-step authentication code required
tt: Ике адымлы аутентификация коды кирәк

source: Two-step authentication could not be disabled.
tt: Ике адымлы аутентификацияне сүндереп булмады.

source: Two-step authentication disabled
tt: Ике адымлы аутентификация сүндерелде

source: Two-step authentication disabled.
tt: Ике адымлы аутентификация сүндерелде.

source: Two-step authentication enabled
tt: Ике адымлы аутентификация кабызылды

source: Two-step verification enabled
tt: Ике адымлы раслау кабызылды

source: Two-step verification is off
tt: Ике адымлы раслау сүндерелде

source: %(uaBrowser)s on %(uaOS)s
tt: %(uaOS)s ОС'ында %(uaBrowser)s

source: %(uaBrowser)s on %(uaOS)s %(uaOSVersion)s
tt: %(uaOS)s %(uaOSVersion)s ОС'ында %(uaBrowser)s

source: Unable to deliver email
tt: Хатны җибәреп булмады

source: Unauthorized
tt: Авторизацияләнмәгән

source: Unavailable device command
tt: Мөмкин булмаган җайланма командасы

source: Unexpected error
tt: Көтелмәгән хата

source: Unexpected resource error
tt: Көтелмәгән ресурс хатасы

source: Unknown account
tt: Билгесез хисап

source: Unknown account. <a href="/signup">Sign up</a>
tt: Билгесез хисап. <a href="/signup">Теркәлү</a>

source: Unknown client
tt: Билгесез мөштәри

source: Unknown code
tt: Билгесез код

source: Unknown customer for subscription.
tt: Язылу өчен билгесез мөштәри.

source: Unknown Firefox Account. <a href="/signup">Sign up</a> using your previous Add-ons account email address to access your Add-ons data.
tt: Билгесез Firefox Хисабы. Өстәмә Кушымталар (Add-ons) мәгълүматына ирешү өчен, Өстәмә Кушымталар хисабыгыздагы элеккеге эл. почта адресыгызны кулланып, <a href="/signup">теркәлү узыгыз</a>.

source: Unknown plan for subscription.
tt: Билгесез язылу планы.

source: Unknown subscription.
tt: Билгесез язылу.

source: Unsubscribed successfully
tt: Абунәлек ябылды

source: Unsupported image provider
tt: Рәсем тәэминатчысы кабул ителми

source: unverified
tt: расланмаган

source: Unverified account
tt: Расланмаган хисап

source: Update
tt: Яңарту

source: Update was rejected, please try again
tt: Яңарту кире кагылды, зинһар кабатлап карагыз

source: Use a different account
tt: Башка бер хисапны куллану

source: Use a different email
tt: Башка бер эл. почта кулланыгыз

source: Use a different email address
tt: Башка эл. почта адресын куллану

source: Use this verification code:
tt: Бу раслау кодын куллану:

source: Valid code required
tt: Дөрес код кирәк

source: Valid email required
tt: Дөрес эл. почта адресы кирәк

source: Valid password required
tt: Дөрес парол кирәк

source: Valid URL required
tt: Дөрес URL кирәк

source: Verification code: %(code)s
tt: Раслау коды: %(code)s

source: Verification email sent
tt: Раслау хаты җибәрелде

source: Verification error
tt: Раслау хатасы

source: Verification link damaged
tt: Раслау сылтамасына зыян килгән

source: Verification link expired
tt: Раслау сылтамасының вакыты узган

source: Verified
tt: Расланды

source: Verify
tt: Раслау

source: Verify email
tt: Эл. почтаны раслау

source: Verify email:
tt: Эл. почта раслау:

source: Verify Email
tt: Эл. почтаны раслау

source: Verify primary email
tt: Беренчел эл. почтагызны раслау

source: Verify secondary email
tt: Икенчел эл. почтаны раслау

source: Verify your email
tt: Эл. почтагызны раслау

source: Verify your email to finish your Firefox Account registration
tt: Firefox Хисабын теркәүне тәмамлау өчен эл. почтагызны раслагыз

source: Verify your Firefox Account
tt: Firefox Хисабыгызны раслагыз

source: We are currently under heavy strain and are working to return the system to normal as soon as possible.
tt: Хәзерге вакытта без авыр йөк астындабыз һәм системаны мөмкин булганча тиз арада нормаль хәленә китерү өстендә эшлибез.

source: Web Session
tt: Веб утырыш

source: Web Session, %(userAgent)s
tt: Веб утырыш, %(userAgent)s

source: Website Privacy Notice
tt: Сайтның Хоcусыйлык Аңлатмасы

source: We detected suspicious activity on your Firefox Account. Your account may have been compromised.
tt: Без Сезнең Firefox Хисабыгызда шөбһәле гамәлләр булуын ачыкладык. Сезнең паролыгыз урланган булырга мөмкин.

source: We have noticed that you are running low on recovery codes. Please consider generating new codes to avoid getting locked out of your account.
tt: Коткару кодларыгыз аз калганына игътибар иттек. Зинһар, кодларыгыз бетеп хисабыгыз бикләнеп калмасын өчен яңаларын ясату турында уйлап карагыз.

source: Welcome!
tt: Хуш килдегез!

source: Welcome back
tt: Хуш кайтасыз

source: Welcome to %(productName)s
tt: %(productName)s-ка рәхим итегез

source: Welcome to the Firefox family
tt: Firefox гаиләсенә рәхим итегез

source: We noticed that you are running low on recovery codes. Please consider generating new codes to avoid getting locked out of your account.
tt: Коткару кодларыгыз аз калганына игътибар иттек. Зинар, кодларыгыз бетеп хисабыгызның бикләнеп калуыннан саклану өчен, яңа кодлар ясату турында уйлап карагыз.

source: We're sorry to hear about this. If this was a device you really don't trust, you should change your Firefox Account password, and change any passwords saved in Firefox.
tt: Бу бик кызганыч. Әгәр бу Сез һич ышанмаган җиһаз булса, Firefox паролыгызны үзгәртергә һәм Firefox'та сакланган барлык паролларны да үзгәртергә кирәк.

source: We're sorry to hear about this. You should change your Firefox Account password, and look for information from your device manufacturer about erasing your data remotely.
tt: Бу бик кызганыч. Сезгә Firefox Хисабыгызның паролын үзгәртергә, һәм җиһазыгызны җитештерүчедән җиһазыгызда булган мәгълүматларны ерак арадан ничек бетереп атып була икәнен белешергә кирәк.

source: We've sent you a text message
tt: Без сезгә SMS җибәрдек

source: What should you do?
tt: Сезгә нишләргә кирәк?

source: When you reset your password, you will lose any Sync data that is not on one of your devices.
tt: Паролыгызны үзгәртсәгез, җиһазларыгызның берсендә дә булмаган Синхронлау бирелгәннәрен югалтачаксыз.

source: Why is this happening?
tt: Бу нидән килеп чыга?

source: Why is this required?
tt: Бу нигә кирәк?

source: Working…
tt: Эштә…

source: You are now ready to make changes to your Firefox Account.
tt: Сез хәзер Firefox аккаунтыгызга үзгәрешләр ясарга әзерсез.

source: You are now ready to use %(serviceName)s
tt: Сез хәзер %(serviceName)s хезмәтен куллана аласыз

source: You have successfully changed your primary email to %(email)s. This address is now your username for signing in to your Firefox Account, as well as receiving security notifications and sign-in confirmations.
tt: Төп электрон почта адресыгызны %(email)s адресына уңышлы үзгәрттегез. Бу адрес хәзер Firefox хисап язмагызга керү өчен кулланучы исемегез булачак. Хәвефсезлек белдерүләре һәм хисап язмагызга керү хакындагы раслаулар да бу адресыгызга киләчәк.

source: You have successfully consumed a recovery code from the following device:
tt: Түбәндәге җиһаздан алынган коткару кодын уңышлы рәвештә кулландыгыз:

source: You have successfully disabled two-step authentication on your Firefox Account from the following device:
tt: Түбәндәге җиһаздан Firefox хисабыгыз өчен ике адымлы аутентификацияне уңышлы рәвештә сүндердегез:

source: You have successfully disabled two-step authentication on your Firefox Account. Security codes will no longer be required at each sign-in.
tt: Firefox Хисабыгыз өчен ике адымлы аутентификацияне сүндердегез. Артык һәр керүдә хәвефсезлек кодлары соралмаячак.

source: You have successfully enabled two-step authentication on your Firefox Account from the following device:
tt: Түбәндәге җиһаздан Firefox аккаунтыгызда ике адымлы аутентификацияне уңышлы гына кабыздыгыз:

source: You have successfully enabled two-step authentication on your Firefox Account. Security codes from your authentication app will now be required at each sign-in.
tt: Firefox хисабыгызда ике адымлы аутентификацияне уңышлы гына кабыздыгыз. Моннан ары һәр керүдә аутентификация кулланмасыннан алынган кодлар кирәк булачак.

source: You have successfully generated an account recovery key for your Firefox Account from the following device:
tt: Түбәндәге җиһазны кулланып, Firefox Хисап өчен хисапны торгызу ачкычын ясату уңышлы булды:

source: You have successfully generated an account recovery key for your Firefox Account using the following device:
tt: Түбәндәге җиһазны кулланып, Firefox Хисабыгыз өчен хисапны торгызу ачкычын ясату уңышлы булды:

source: You have successfully generated new recovery codes from the following device:
tt: Түбәндәге җиһаз ярдәмендә яңа коткару кодларын яратттыгыз:

source: You have successfully removed an account recovery key for your Firefox Account from the following device:
tt: Түбәндәге җиһазны кулланып, Firefox Хисабыгыз өчен хисапны коткару кодын уңышлы бетердегез:
